[
    {
      "id": "01",
      "name": "Eduartodo",
      "image_profil": "../asset/img/project/eduartodo/img0.png",
      "langage": ["HTML", "CSS", "JavaScript", "PHP", "MySQL", "Ajax"],
      "date": "2023-06",
      "role": ["Développeur Full Stack / Conception"],
      "duree": 50,
      "equipe": "Groupe de 4",
      "apercu": "Dans le cadre de mon cours de génie logiciel à l’UQAC, j’ai travaillé sur un projet de gestion de tâches en équipe de quatre personnes sur un trimestre. L’objectif était de concevoir une plateforme intuitive permettant aux utilisateurs d’organiser et de suivre l’évolution de leurs tâches de manière efficace. Nous avons mis en place un système de gestion collaborative avec des fonctionnalités comme l’ajout, la modification et la suppression de tâches, ainsi que l’attribution de responsabilités. Durant ce projet, j’ai eu l’opportunité de suivre la méthode Scrum, ce qui m’a permis de mieux comprendre la gestion agile et l’importance des itérations dans le développement logiciel. Ce projet nous a permis d’approfondir nos compétences en développement web et en gestion de projet tout en appliquant les principes du génie logiciel.",
      "liens": "https://github.com/Nunbus1/EduarToDo",
      "image1": "../asset/img/project/eduartodo/img1.png",
      "image2": "../asset/img/project/eduartodo/img2.png",
      "image3": "../asset/img/project/eduartodo/img3.png",
      "video": ""
    },
    {
      "id": "02",
      "name": "Système Solaire",
      "image_profil": "../asset/img/project/Systeme_Solaire/img0.png",
      "langage": ["HTML", "CSS", "JS", "C"],
      "date": "2023-08",
      "role": ["Développeur WEB"],
      "duree": 50,
      "equipe": "Groupe de 2",
      "apercu": "Dans le cadre de ma première année en prépa intégrée à l'ISEN, j’ai travaillé en binôme sur un projet d’une semaine visant à développer un site web de visualisation des planètes du système solaire. Nous devions calculer la position des planètes en utilisant les méthodes d’Euler et d’Euler-asymétrique afin de simuler leurs trajectoires de manière réaliste. Les données calculées étaient ensuite stockées dans un fichier JSON, que nous exploitions pour afficher les planètes en 3D sur notre site web. Ce projet nous a permis de combiner des notions de physique et d’informatique en mettant en œuvre des calculs numériques appliqués à une interface interactive. Il nous a également appris à structurer et exploiter des fichiers de données pour rendre une simulation dynamique et visuellement attrayante.",
      "liens": "https://github.com/Nunbus1/Systeme_Solaire",
      "image1": "../asset/img/project/Systeme_Solaire/img1.png",
      "image2": "../asset/img/project/Systeme_Solaire/img2.png",
      "image3": "../asset/img/project/Systeme_Solaire/img3.png",
      "video": ""
    },
    {
      "id": "03",
      "name": "Application de musique",
      "image_profil": "../asset/img/project/Music_App/img0.png",
      "langage": ["HTML", "CSS", "JavaScript", "PHP", "MySQL", "Ajax"],
      "date": "2024-01",
      "role": ["Developer Front End"],
      "duree": 70,
      "equipe": "Groupe de 2",
      "apercu": "Lors de ma deuxième année de prépa intégrée, j’ai travaillé en binôme sur un projet de 10 jours visant à développer un lecteur de musique en ligne. L’application permettait aux utilisateurs de créer un compte, de se connecter et d’écouter leurs propres musiques directement sur le site. Nous avons également intégré un système de gestion de playlists, offrant la possibilité d’ajouter des morceaux et de les lire de manière fluide. La communication entre le front-end et le back-end était assurée via AJAX, garantissant une expérience utilisateur dynamique et réactive. Ce projet m’a permis de consolider mes compétences en développement front-end tout en approfondissant ma compréhension de l’interaction entre les différentes couches d’une application web.",
      "liens": "https://github.com/Oxbian/Projet-CIR2",
      "image1": "../asset/img/project/Music_App/img1.png",
      "image2": "../asset/img/project/Music_App/img2.png",
      "image3": "../asset/img/project/Music_App/img2.png",
      "video": ""
    },
    {
      "id": "04",
      "name": "Arbres de Saint-Quentin",
      "image_profil": "../asset/img/project/Tree/img0.png",
      "langage": ["HTML", "CSS", "JavaScript", "PHP", "MySQL", "Ajax", "Python"],
      "date": "2024-03",
      "role": ["AI Engineer, Developer Front End"],
      "duree": 150,
      "equipe": "Groupe de 3",
      "apercu": "Le projet Arbres de Saint-Quentin, réalisé en troisième année d’école d’ingénieur en groupe de trois personnes sur trois semaines, visait à concevoir une application web dédiée à l’analyse et à la visualisation du patrimoine arboré de la ville. Ce projet combinait plusieurs aspects, notamment le Big Data, l’intelligence artificielle et le développement web. Dans la partie Big Data, les données sur les arbres ont été récupérées depuis un fichier CSV open data, nettoyées et analysées à l’aide de modèles statistiques sous R pour produire des visualisations interactives. L’aspect IA du projet s’est concentré sur la prédiction de l’âge des arbres et la mise en place d’un système d’alerte pour anticiper les arbres susceptibles d’être déracinés lors de tempêtes. Enfin, dans la partie web, j’ai travaillé sur l’affichage des cartes et la partie front-end du site, qui permet d’explorer ces données et d’ajouter de nouvelles informations sur les arbres.",
      "liens": "https://github.com/Nunbus1/Projet_Web",
      "image1": "../asset/img/project/Tree/img1.png",
      "image2": "../asset/img/project/Tree/img2.png",
      "image3": "../asset/img/project/Tree/img3.png",
      "video": ""
    },
    {
        "id": "05",
        "name": "Platformer Qt",
        "image_profil": "../asset/img/project/Qt/img0.png",
        "langage": ["C++", "QT"],
        "date": "2024-03",
        "role": ["Game Developer"],
        "duree": 150,
        "equipe": "Seul",
        "apercu": "Ce projet s’est déroulé lors de ma deuxième année en prépa intégrée à l’ISEN sur une durée de deux mois. J’ai développé seul un petit jeu platformer en utilisant Qt et C++, ce qui m’a permis de consolider mes compétences en programmation tout en découvrant un nouvel environnement de développement. Qt n’étant pas initialement conçu pour la création de jeux, j’ai rencontré plusieurs difficultés, notamment dans la gestion des assets et l’affichage graphique. J’ai dû trouver des solutions adaptées pour intégrer les ressources visuelles et assurer une fluidité optimale du gameplay. Cette expérience m’a permis de mieux comprendre les contraintes techniques liées au développement de jeux sur des frameworks non spécialisés, tout en renforçant ma maîtrise de C++.",
        "liens": "",
        "image1": "../asset/img/project/Qt/img1.png",
        "image2": "../asset/img/project/Qt/img2.png",
        "image3": "../asset/img/project/Qt/img3.png",
        "video": ""
    },
    {
        "id": "06",
        "name": "PacMan",
        "image_profil": "../asset/img/project/Pacman/img0.png",
        "langage": ["C#", "Unity"],
        "date": "2024-01",
        "role": ["Game Developer"],
        "duree": 15,
        "equipe": "Groupe de 3",
        "apercu": "Ce projet, réalisé en un trimestre à l’UQAC en groupe de trois personnes, consistait à redévelopper Pac-Man sous Unity en C# tout en y ajoutant des mécaniques inédites. Il m’a permis de découvrir et d’apprendre à utiliser Unity, tout en adoptant une approche structurée du développement de jeux vidéo, notamment à travers la rédaction d’un Game Design Document (GDD). Nous avons repensé le jeu original en intégrant un système de bonus, obtenus aléatoirement via un système de cartes, ajoutant ainsi un élément stratégique au gameplay. Ce projet m’a permis de mieux comprendre la gestion des mécaniques de jeu, l’implémentation de comportements d’IA, ainsi que l’organisation d’un projet en équipe dans un cadre proche du développement professionnel.",
        "liens": "https://github.com/tlegoc/UQAC_Pacman",
        "image1": "../asset/img/project/Pacman/img1.png",
        "image2": "../asset/img/project/Pacman/img2.png",
        "image3": "../asset/img/project/Pacman/img3.png",
        "video": ""
    },
    {
        "id": "07",
        "name": "Wonderjam AUTOMNE",
        "image_profil": "../asset/img/project/doomension/img0.png",
        "langage": ["C#", "Unity"],
        "date": "2024-01",
        "role": ["Game Developer, Map Designer"],
        "duree": 50,
        "equipe": "Groupe de 5",
        "apercu": "J’ai relevé le défi de la WonderJam Automne, une Game Jam organisée par l’UQAC et Ubisoft, en développant un jeu vidéo en 48 heures avec une équipe de cinq personnes. Le thème principal était dimension, auquel nous avons ajouté des mécaniques supplémentaires : joueur contre joueur, maniaque et aide ton allié. Notre jeu met en scène Dee et Mension, deux personnages perdus dans une grotte depuis plusieurs jours. Affaiblis par la faim et la solitude, ils sombrent dans la folie et commencent à voir des fantômes issus d’une autre dimension, apparaissant dans l’obscurité dès qu’ils détournent leur regard. Pour se défendre, ils utilisent d’étranges lampes mystiques, capables de révéler ces entités et de les repousser dans leur dimension d’origine. Le but du jeu est donc de se déplacer intelligemment dans sa zone tout en éclairant les environs afin d’éviter d’être attaqué. Le premier des deux joueurs qui n'a plus de vie perd la partie. Qui sera le dernier en vie ? Ce projet m’a permis de renforcer mes compétences en développement rapide de jeux sous pression, en game design et en travail d’équipe, tout en explorant des mécaniques asymétriques et stratégiques.",
        "liens": "https://tea-enjoyers.itch.io/doomension",
        "image1": "../asset/img/project/doomension/img1.png",
        "image2": "",
        "image3": "",
        "video": ""
    },
    {
        "id": "08",
        "name": "Wonderjam HIVER",
        "image_profil": "../asset/img/project/WonderjamHiver/img0.png",
        "langage": ["Unreal engine", "Blueprint"],
        "date": "2024-01",
        "role": ["Game Developer"],
        "duree": 50,
        "equipe": "Groupe de 4",
        "apercu": "J’ai une nouvelle fois relevé le défi de la WonderJam Hiver, la Game Jam organisée par l’UQAC et Ubisoft, en développant un jeu en 48 heures avec une équipe de quatre personnes. Pour cette édition, j’ai occupé le rôle de développeur Unreal Blueprint, ce qui m’a permis d’approfondir mes compétences sur ce moteur.Nous avons créé Melty, un jeu où le joueur incarne un glaçon cherchant à rejoindre un bateau sur la plage. Le gameplay repose sur une mécanique de fonte progressive : plus le joueur avance et franchit des frontières thermiques, plus la chaleur augmente, accélérant ainsi sa disparition. Pour survivre, il doit récupérer des flocons de neige, qui ralentissent la fonte et lui permettent d’aller plus loin. L’objectif est de gérer intelligemment sa trajectoire et ses ressources pour atteindre la plage avant de disparaître complètement. Ce projet m’a permis de développer un gameplay dynamique basé sur des mécaniques de survie, tout en explorant les contraintes physiques et thermiques d’un personnage évoluant dans un environnement hostile. Travailler sous Unreal Engine et Blueprint m’a également permis de gagner en efficacité dans le prototypage rapide et d’appliquer mes connaissances en game design dans un cadre compétitif et limité en temps.",
        "liens": "https://kiribaton.itch.io/melty",
        "image1": "../asset/img/project/WonderjamHiver/img1.png",
        "image2": "../asset/img/project/WonderjamHiver/img2.png",
        "image3": "../asset/img/project/WonderjamHiver/img3.png",
        "video": ""
    }
    ,
    {
        "id": "09",
        "name": "Pivoteur",
        "image_profil": "../asset/img/project/Cubiks/img0.png",
        "langage": ["Unreal engine", "Blueprint"],
        "date": "2024-01",
        "role": ["Game Developer, Map Designer"],
        "duree": 50,
        "equipe": "Groupe de 3",
        "apercu": "Pivoteur est un jeu d’aventure développé en un trimestre lors de mon premier trimestre à l’UQAC, en groupe de trois personnes, avec Unreal Engine et Blueprint. Le concept repose sur une mécanique unique où le personnage a la capacité de faire pivoter des objets pour résoudre des casse-têtes et progresser à travers les niveaux. Ce projet m’a permis de découvrir Unreal Engine et Blueprint, en explorant leurs fonctionnalités et leurs possibilités en matière de gameplay interactif. Au-delà du développement technique, j’ai également été initié à plusieurs concepts fondamentaux du développement de jeux vidéo. J’ai pu approfondir ma compréhension du game design et des mécaniques de jeu, tout en découvrant les processus de développement dans l’industrie du jeu vidéo. J’ai aussi été sensibilisé à l’importance de l’assurance qualité, des tests et du post-mortem, qui permettent d’identifier et de corriger les points d’amélioration du jeu. L’architecture logicielle d’un jeu vidéo a également été un point clé du projet, notamment pour structurer le code et assurer une bonne organisation du développement. Enfin, nous avons travaillé sur l’élaboration d’un Game Design Document (GDD), un outil essentiel pour formaliser les concepts et guider la production. Grâce à cette expérience, j’ai pu comprendre les enjeux de production d’un jeu vidéo et l’importance des tests et de l’itération pour affiner le gameplay et améliorer l’expérience utilisateur.",
        "liens": "",
        "image1": "../asset/img/project/Cubiks/img1.png",
        "image2": "../asset/img/project/Cubiks/img2.png",
        "image3": "../asset/img/project/Cubiks/img3.png",
        "video": ""
    },
    {
        "id": "10",
        "name": "Moteur physique",
        "image_profil": "",
        "langage": ["C++", "OpenFramework"],
        "date": "2024-01",
        "role": ["Developer"],
        "duree": 100,
        "equipe": "Groupe de 4",
        "apercu": "Ce projet, réalisé sur un trimestre en groupe de quatre personnes, avait pour objectif de développer un moteur de jeu physique et mathématique en C++. Nous avons conçu un moteur capable de simuler différents concepts physiques essentiels, permettant d’appliquer des interactions réalistes aux objets du jeu. Nous avons implémenté plusieurs fonctionnalités fondamentales. La gestion des rigidbodies permettait de simuler des mouvements et des collisions réalistes en tenant compte des forces appliquées aux objets. Les systèmes de ressorts ont été intégrés pour modéliser des comportements dynamiques et apporter davantage de réalisme aux simulations physiques. Nous avons également utilisé des bounding boxes pour la détection des collisions et l’optimisation des calculs, garantissant ainsi une meilleure efficacité du moteur. Enfin, la résolution des forces et des frottements a été mise en place pour affiner la simulation des objets en mouvement et améliorer la précision des interactions. Ce projet m’a permis d’approfondir ma compréhension des principes de physique appliqués aux jeux vidéo, tout en consolidant mes compétences en programmation C++ et en conception de moteur de jeu. Travailler sur un moteur from scratch m’a apporté une meilleure maîtrise des calculs mathématiques liés aux simulations physiques et de l’optimisation des performances pour garantir une exécution fluide et efficace.",
        "liens": "https://github.com/Artyu24/Moteur-Physique-SonicTeam",
        "image1": "",
        "image2": "",
        "image3": "",
        "video": ""
    },
    {
        "id": "11",
        "name": "Projet de mathématiques",
        "image_profil": "../asset/img/project/Rangement/img0.png",
        "langage": ["Python"],
        "date": "2024-01",
        "role": ["Developer"],
        "duree": 50,
        "equipe": "Groupe de 3",
        "apercu": "Lors de ma troisième année d'école d’ingénieur, j’ai travaillé sur un projet de mathématiques d’une semaine en équipe de trois personnes. L’objectif était de développer un algorithme en Python permettant de ranger des box de la manière la plus optimisée possible dans des wagons. Nous devions résoudre ce problème d’optimisation en tenant compte de plusieurs contraintes. Le rangement devait se faire en 1D, 2D et 3D, en prenant en compte les dimensions des box et des wagons afin de maximiser l’espace utilisé. L’algorithme devait également calculer le nombre minimal de wagons nécessaires pour stocker toutes les box tout en garantissant une répartition efficace. Nous avons aussi implémenté un mode online et offline, permettant soit un traitement en temps réel, soit une optimisation en différé. L’un des principaux défis était de trouver une stratégie efficace pour éviter les pertes d’espace et garantir un remplissage optimal des wagons. Ce projet m’a permis d’approfondir mes compétences en algorithmie et en programmation Python, tout en appliquant des concepts d’optimisation combinatoire et de gestion des ressources. Il m’a également apporté une meilleure compréhension des approches heuristiques et exactes pour résoudre des problèmes de packing dans un contexte industriel.",
        "liens": "https://github.com/Nunbus1/Projet_Math",
        "image1": "../asset/img/project/Rangement/img1.png",
        "image2": "../asset/img/project/Rangement/img2.png",
        "image3": "../asset/img/project/Rangement/img3.png",
        "video": ""
    },
    {
        "id": "12",
        "name": "Jeu en réseau",
        "image_profil": "../asset/img/project/Jeu_Reseau/img0.png",
        "langage": ["Unreal engine", "C++", "Blueprint"],
        "date": "2024-01",
        "role": ["Game Developer"],
        "duree": 40,
        "equipe": "Seul",
        "apercu": "Ce projet, réalisé en solo sur un mois avec Unreal Engine et C++, consiste à développer un système de gestion de menu, de lobby et de jeu en réseau. L’objectif est de permettre aux joueurs de choisir et conserver leur skin tout en assurant une synchronisation fluide entre les clients et le serveur. Ce projet m’a permis d’appliquer les notions de réseau dans Unreal Engine, notamment en optimisant l’échange de données pour minimiser la bande passante et garantir une expérience en ligne stable. La gestion du lobby multijoueur et la persistance des choix des joueurs sont des éléments clés que j’ai implémentés en structurant l’architecture du projet de manière efficace. Toujours en cours de développement, ce projet me permet d’approfondir mes compétences en programmation réseau, en gestion des connexions client-serveur et en optimisation des échanges de données pour un jeu en ligne performant.",
        "liens": "",
        "image1": "../asset/img/project/Jeu_Reseau/img1.png",
        "image2": "../asset/img/project/Jeu_Reseau/img2.png",
        "image3": "../asset/img/project/Jeu_Reseau/img3.png",
        "video": ""
    }
]
