[
    {
      "id": "01",
      "name": "Portfolio Website",
      "image_profil": "../asset/img/IMG_1742.jpg",
      "langage": ["HTML", "CSS", "JavaScript"],
      "date": "2023-06",
      "role": ["Développeur Frontend"],
      "duree": 120,
      "equipe": "Seul",
      "apercu": "La création de mon portfolio personnel a pour objectif de présenter mes projets et mes compétences de manière claire et structurée. Il me permettra de mettre en avant mes réalisations en détaillant les technologies utilisées et les défis relevés. Ce portfolio servira également de support professionnel pour montrer mon évolution et mon expertise dans différents domaines. J'y inclurai des descriptions détaillées, des images et des démonstrations interactives pour donner un aperçu concret de mon travail. Enfin, il constituera un espace dynamique que je mettrai régulièrement à jour pour refléter mes nouvelles expériences et compétences acquises.",
      "liens": "https://www.google.com/search?q=google&oq=google",
      "image1": "../asset/img/IMG_1742.jpg",
      "image2": "../asset/img/IMG_1742.jpg",
      "image3": "../asset/img/IMG_1742.jpg",
      "video": ""
    },
    {
      "id": "02",
      "name": "E-commerce Platform",
      "image_profil": "../asset/img/IMG2.jpg",
      "langage": ["React", "Node.js", "MongoDB"],
      "date": "2023-08",
      "role": ["Développeur Fullstack"],
      "duree": 200,
      "equipe": "Groupe de 4",
      "apercu": "Le développement d’une plateforme e-commerce complète implique la mise en place d’un système de gestion de produits efficace et intuitif. Il est essentiel d’intégrer des fonctionnalités avancées permettant aux utilisateurs d’ajouter, modifier et organiser leurs articles de manière fluide. La sécurité des paiements est également une priorité, nécessitant l’implémentation de protocoles fiables pour protéger les transactions et les données sensibles des clients. Un design ergonomique et une navigation optimisée garantissent une expérience utilisateur agréable et facilitent le parcours d’achat. Enfin, des outils d’analyse et de suivi des ventes permettent aux commerçants d’ajuster leur stratégie en fonction des performances du site.",
      "liens": "https://www.google.com/search?q=google&oq=google",
      "image1": "../asset/img/IMG2.jpg",
      "image2": "../asset/img/IMG2.jpg",
      "image3": "../asset/img/IMG2.jpg",
      "video": "https://www.youtube.com/watch?v=Wy_pdCpvKEk"
    },
    {
      "id": "03",
      "name": "Mobile Game",
      "image_profil": "../asset/img/IMG-20240103-WA0000.jpg",
      "langage": ["C#", "Unity"],
      "date": "2024-01",
      "role": ["Game Developer"],
      "duree": 150,
      "equipe": "Groupe de 3",
      "apercu": "Le développement d’un jeu mobile en 2D repose sur la création de mécaniques innovantes pour offrir une expérience de jeu unique et captivante. Un soin particulier est apporté au level design afin de garantir une progression fluide et stimulante pour les joueurs. L’optimisation des contrôles et des animations est essentielle pour assurer une jouabilité réactive et agréable sur tous les appareils mobiles. L’intégration de graphismes attrayants et d’une direction artistique cohérente permet d’immerger pleinement les joueurs dans l’univers du jeu. Enfin, des tests rigoureux sont réalisés pour ajuster l’équilibrage et corriger les éventuels bugs avant la sortie officielle.",
      "liens": "https://www.google.com/search?q=google&oq=google",
      "image1": "../asset/img/IMG-20240103-WA0000.jpg",
      "image2": "../asset/img/IMG-20240103-WA0000.jpg",
      "image3": "../asset/img/IMG-20240103-WA0000.jpg",
      "video": "https://www.youtube.com/watch?v=Wy_pdCpvKEk"
    },
    {
      "id": "04",
      "name": "AI Assistant",
      "image_profil": "../asset/img/20240924_214641.jpg",
      "langage": ["Python", "TensorFlow", "NLP"],
      "date": "2024-03",
      "role": ["AI Engineer"],
      "duree": 180,
      "equipe": "Seul",
      "apercu": "Le développement d’un assistant vocal intelligent repose sur l’intégration de technologies avancées en reconnaissance vocale et en traitement du langage naturel. Cet assistant doit être capable de comprendre et d’exécuter des commandes vocales complexes avec précision, en tenant compte du contexte et des nuances du langage. Son apprentissage et son adaptation aux préférences des utilisateurs sont essentiels pour améliorer l’expérience et la pertinence des réponses fournies. L’optimisation des performances, notamment en termes de rapidité et de gestion des erreurs, garantit une interaction fluide et naturelle. Enfin, l’intégration avec divers services et appareils connectés permet d’étendre ses fonctionnalités et de le rendre encore plus polyvalent et utile au quotidien.",
      "liens": "https://www.google.com/search?q=google&oq=google",
      "image1": "../asset/img/20240924_214641.jpg",
      "image2": "../asset/img/20240924_214641.jpg",
      "image3": "../asset/img/20240924_214641.jpg",
      "video": "https://www.youtube.com/watch?v=Wy_pdCpvKEk"
    }
]
